package com.example.dragonball;

import android.os.Bundle;
import android.widget.SearchView;
import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;
import java.util.ArrayList;
import java.util.List;

public class MainActivity extends AppCompatActivity {
    private RecyclerView recyclerView;
    private CharacterAdapter adapter;
    private List<Character> characterList;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

        recyclerView = findViewById(R.id.recyclerView);
        SearchView searchView = findViewById(R.id.searchView);

        // רשימת דמויות
        characterList = new ArrayList<>();
        characterList.add(new Character("Goku", "סון גוקו (אנגלית: Son Goku, וביפנית: 孫 悟空) נודע גם בקצרה בשם גוקו, או בשמו הסאייני קאקארוטו, הוא הדמות הראשית בסדרת הטלוויזיה והמאנגה היפנית \"דרגון בול\". בתחילה הוא נוצר בתור דמות קומיקס על ידי אקירה טוריאמה, ודמותו מבוססת על סון ווקונג דמות ראשית ברומן \"המסע למערב\". גוקו הוצג כילד מוזר בעל זנב-קוף, המתאמן באמנות לחימה ושנמצא בידו כוח על אנושי. אף על פי שנהוג היה לחשוב בתחילת הסדרה שגוקו הוא בן-אנוש התגלה בהמשך שהוא חלק מגזע הנקרא \"הסאיינים\", גזע חוצני של דמויי פרימטים וששמו האמיתי הוא קאקרוט (ביפנית: カカロット; קאקרוטו).", R.drawable.goku));
        characterList.add(new Character("Vegita", "מקיטה (במקור: וג'יטה. ביפנית: ベジータ, באנגלית: Vegeta), הידוע גם בתוארו המלא הנסיך מקיטה הרביעי (יפנית: ベジータ 王子 四世, אנגלית: Prince Vegeta IV) הוא דמות בדיונית המופיעה בזיכיון המאנגה והאנימה \"דרגון בול\" מאת אקירה טוריאמה. דמותו של מקיטה הופיעה לראשונה בפרק 204 של המאנגה המקורית, \"Sayonara, Son Goku!\", שם הופיע תחילה כנבל-על המבקש לפלוש לכדור הארץ על מנת לאסוף את שבעת כדורי הדרגון בול ולזכות בחיי נצח. עם התקדמות העלילה, הפך בהדרגה לאנטי-גיבור ולגיבור-על.", R.drawable.vegita));
        characterList.add(new Character("picolo", "בנו של המלך הנאמקי המלך פיקולו. נוצר כדי לנקום בגוקו בעקבות מותו של המלך. מקבל בהמשך את התפקיד כ\"חצי הרשע\" של קאמי. לאחר שהובס בדוחק על ידי גוקו, הוא חובר אתו ועם חבריו כנגד סייאנים הפולשים. מאוחר יותר מתגלה כנמקיאן - זן אנושי בעל עור ירוק, בעל ארבע אצבעות, חסר שיער, שיצר את כדורי הדרגון בול של הסדרה. מת כשהוא מקריב את עצמו בהגנת גוהאן במהלך הקרב נגד ה-Saiyan Nappa,מתאמן בחיים שלאחר המוות תחת המלך קאי לפני שהתקבל בחזרה לחיים על ידי כדורי הדרקון הנמקים. ביפנית הוא מדובב בידי טושיו פורוקאווה, באנגלית הוא מדובב בידי השחקן כריסטופר סאבט ובעברית הוא מדובב בידי השחקן צביקה שוורצברג.", R.drawable.picolo));
        characterList.add(new Character("master_roshi", "(\"הנזיר הצב\"), הידוע גם בשם Muten-Rōshi (מואר \"מאסטר גאון אמנויות לחימה\"). מדריך אמן אמנויות לחימה קשיש שחי על אי קטן והוא הממציא של טכניקת קמחמהה. הוא אימן את סבא גוהן ו-Ox-king, גוקו וקרילין ועוד. מאסטר רושי הוכשר על ידי מאסטר מוטאיטו, אשר אימן גם את קבוצתו, שהפכה ליריבה צורו-סנ'נין (\"נזיר עגור\"); קיבל גם הכשרה נוספת מקורין. הוא מופיע בעילום שם בטורניר אמנויות הלחימה העולמי, מאסטר רושי משתמש בשם \"ג'קי צ'ון\" (Jakkī Chun), חובש פאה ומשליך את משקפי השמש שלו. ביפנית הוא מדובב בידי קוהיי מיאוצ'י, באנגלית הוא מדובב בידי מייק מקפרלנד ובעברית הוא מדובב בידי השחקן דב רייזר.", R.drawable.master_roshi));
        characterList.add(new Character("krillin", "הגיע ממנזר בצפון. נמצא עם גוקו בהדרכת מאסטר רושי. התחילו כיריבים ונעשו חברים ושותפים להרפתקאות. נהרג על ידי טמבורין השרצים של המלך פיקולו, וקם לתחיה על ידי שנרון. הוא נוסע לכוכב נאמק שם נהרג על ידי פריזה, ולאחר שהוחזר לחיים שוב על ידי כדורי הדרקון הנאמקים. נשוי לאנדרואיד 18 ולהם בת מארון. המהלך המיוחס אליו הוא קיאנזאן (הצלחת המעופפת) וסולאר פלאש (מכת שמש שהומצא על ידי טיינשינהאן). בהמשך הוא מפתח סולאר פלאש חזק יותר שהוא קורא לו סולאר פלאש פי 100. ביפנית הוא מדובב על ידי מאיומי טנאקה, באנגלית הוא מדובב בידי מייק תיסן ובעברית הוא מדובב בידי השחקן שמחה ברבירו.", R.drawable.krillin));
        characterList.add(new Character("majin buu", "מתרחש טורניר באמנויות לחימה ה - 28 מגיע ועמו מגיע גם יריב חדש - אוּבּ, שהוא למעשה קיד בו שנולד מחדש. אוב מתגלה כיריב עוצמתי, נלחם נגד גוקו אך הקרב נפסק כאשר גוקו מציג את עצמו בפניו, מחליט לקחת אותו תחת חסותו כתלמיד ולאמן אותו.", R.drawable.majin_buu));
        characterList.add(new Character("gohan", "בנו הבכור של גוקו עם צ'י-צ'י. מתחתן עם וידל, איתה נולדה לו מאוחר יותר בת בשם פאן. ביד אחת כשהיה בן 11. מופיע לראשונה בגיל ארבע. נחטף על ידי אחיו של גוקו, ראדיץ, וכלוא בתרמיל חלל. הוא פורץ מתוך תרמיל החלל, מכה את ראדיץ ומפיל את עצמו. פיקולו מאמן אותו במשך שנה כשהוא מביא למימוש את הפוטנציאל של גוהאן. הצעיר ביותר בסדרה שהפך לסופר סאיין 2. גילה את מצב הסופר סאיין 2 בקרב נגד סל אותו ניצח בקרב באמצעות הקאמהאמהא. בהדרגה הופך לאחת הדמויות החזקות בסדרה. בסיום הסדרה גוהאן ממשיך להתאמן. הוא הלוחם החזק בכדור הארץ בסוף דרגון בול Z. שינוי הצורה המיוחס לו הוא מצב \"מיסטיק\". המהלך המיוחס לו הוא מאסנקו שלמד מפיקולו. ביפנית הוא מדובב בידי מאסאקו נוזאווה, באנגלית הוא מדובב בידי קייל הברט ובעברית לעיתים הוא מדובב בידי השחקנים תובל שפיר בכמה מהסרטים של דרגון בול, תומר גלר, עידו מוסרי (בדרגון בול GT) ואורי הר-לב.", R.drawable.gohan));
        characterList.add(new Character("trunks", "(Torankusu) בנם של בולמה ווג'יטה. אחיה הגדול של ברה. חברו הטוב ביותר של גוטן ושותפו למיזוג. בא מקו זמן אחר כדי להזהיר את לוחמי ה-Z מפני האנדרואידים. יש לו חרב שחיסלה את פריזה, המהלך המיוחס לו הוא פיינל פלאש. מופיע לראשונה כצעיר מסתורי המביס בקלות את פריזה ואביו המלך קולד, לפני שובו של גוקו לכדור הארץ מכוכב הלכת נאמק. הוא הילד העתידי של וגטה ובולמה שנסע אחורה בזמן כדי להודיע לגוקו על הגעת אנדרואיד הסרט האדום שבזמנו הרגו את כולם בצוות הדרקון פרט לגוקו שמת ממחלת לב. סיפור הרקע של טראנקס מפורט בספיישל טלוויזיה: The History of Trunks. הוא עוזר להילחם נגד האנדרואידים לפני שחוזר לציר הזמן שלו.", R.drawable.trunks));
        characterList.add(new Character("bulma", "בתו של דוקטור בריף, ראש תאגיד קפסולה. נישאה לווג'יטה, אמם של טראנקס וברה. מוכשרת מאוד, מפתחת (המציאה את רדאר הדרגון בול). באופייה אגואיסטית וגאוותנית. הראשונה שגוקו פוגש לאחר מות סבו המאמץ גוהאן. בהשפעתה יוצא לחיפוש אחר הדרגון בול. קנתה לאנדרואיד 17 ספינה אחרי שניצח בטורניר העוצמה והשאיר את יקום 7 חי. מדובבת ביפנית על ידי הירומי טסורו, באנגלית היא מדובבת על ידי טיפאני וולמר ובעברית היא מדובבת על ידי השחקנית יפעת זנדני צפריר.", R.drawable.bulma));
        characterList.add(new Character("chichi", "אשתו של גוקו ואימם של גוהאן, גוטן ודניאלה סבתא לפאן ובתו של אוקס קינג/גיומאו. היא וגוקו נפגשים לראשונה בילדותם כשאביה, מלך השור, מבקש מגוקו לקחת אותה לביתו של מאסטר רושי. מתוך אי הבנה גוקו מבטיח להתחתן איתה. היא חוזרת אליו עם הבטחתו זו שנים מאוחר יותר בטורניר אמנויות הלחימה העולמי ה-23, והם מתחתנים. מתוארת כמגוננת יתר על המידה על רווחתו של גוהאן, רוצה לקטוע את אורח חייו הכולל לחימה וסכסוך מתמידים. רוצה שימצא עבודה וירוויח כסף. משנה את עמדתה לגבי בנה הצעיר גוטן, אותו היא אפילו מאמנת. הכירה בעברה בילדותה את ג'קו, חברו הטוב של ג'אקו כשהייתה בת 5.", R.drawable.chichi));

        adapter = new CharacterAdapter(characterList);
        recyclerView.setLayoutManager(new LinearLayoutManager(this));
        recyclerView.setAdapter(adapter);

        // סינון חיפוש
        searchView.setOnQueryTextListener(new SearchView.OnQueryTextListener() {
            @Override
            public boolean onQueryTextSubmit(String query) {
                return false;
            }

            @Override
            public boolean onQueryTextChange(String newText) {
                filterList(newText);
                return true;
            }
        });
    }

    private void filterList(String text) {
        List<Character> filteredList = new ArrayList<>();
        for (Character character : characterList) {
            if (character.getName().toLowerCase().contains(text.toLowerCase())) {
                filteredList.add(character);
            }
        }
        adapter.updateList(filteredList);
    }
}
